In [23]:
import crud_operations as co
import sqlparse
from itertools import islice
import re
import pandas as pd

In [24]:
def processQueries():
    db = co.MySQLDB('pl_queries')
    
    queries = {}
    res = db.readAllQueries()
    for q in res:
        queries[(q[0], q[1], q[2])] = q[3]
    return queries

In [25]:
queries = processQueries()

In [26]:
len(queries)

1418

In [27]:
# Try with one query
curr = queries[(1,313665,4388082)]
parsed = sqlparse.parse(curr)
print(parsed[0])
print(parsed[0].tokens)

for tok in parsed[0].tokens:
    # print(tok.ttype, type(tok))
    if (type(tok) == sqlparse.sql.Identifier):
        print(tok.value)

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and
        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and
        (e.empName like '_a%' or e.empName like '_i%')
order by e.empName asc, d.deptName desc
[<DML 'select' at 0x112C1CD00>, <Whitespace ' ' at 0x112C1CE50>, <IdentifierList 'e.empN...' at 0x10A330AD0>, <Newline ' ' at 0x112C1CDE0>, <Keyword 'from' at 0x10A3B0830>, <Whitespace ' ' at 0x10A3B0910>, <Identifier 'Employ...' at 0x10A3304D0>, <Whitespace ' ' at 0x10A3B0AD0>, <Keyword 'natura...' at 0x10A3B08A0>, <Whitespace ' ' at 0x10A3B0BB0>, <Identifier 'Depart...' at 0x10A3305D0>, <Newline ' ' at 0x10A3B0B40>, <Where 'where ...' at 0x112C17D50>, <Keyword 'order ...' at 0x10A336280>, <Whitespace ' ' at 0x10A3362F0>, <IdentifierList 'e.empN...' at 0x10A330050>]
Employee e
Department d

In [28]:
# For first ten queries, let's substitute:
def parse(queries):
    aliases = ['a', 'b', 'c', 'd', 'e', 'f']
    parsed_queries = []
    f = open("parsed_queries.csv", "w")
    df1 = pd.DataFrame(columns=['queryNum','queryID','variantID','queryText'])
    for query in queries:
        #print("New Query\n")
        content = query[1]
        #print(content)
        curr_alias = 0
        
        parsed = sqlparse.parse(query[1])
        
        #if len(parsed) == 1:
        prev_keyword = ""
        for tok in parsed[0].tokens:
            # print(type(tok), tok.ttype, tok.value)
            if(str(tok.ttype) == "Token.Keyword"):
                prev_keyword = tok.value.lower()
            if(type(tok) == sqlparse.sql.Identifier) and (prev_keyword == "from" or "join" in prev_keyword):
                # Process tok.value
                # The order of Department vs. Employee shouldn't matter
                alias = tok.value.split(" ")
                #print(alias)
                if(len(alias) > 1 and (alias[-1].lower != "asc" or alias[-1].lower != "desc")):
                    content = content.replace(" " + alias[-1] + " ", " " + aliases[curr_alias] + " ")
                    content = content.replace(alias[-1] + ".", aliases[curr_alias] + ".")
                    curr_alias += 1

            if(type(tok) == sqlparse.sql.IdentifierList):
                # use regex to make sure is alias one
                if re.match(r'[a-zA-Z ]+ [a-zA-Z ]+,*', tok.value):
                    sets = tok.value.split(",")
                    for s in sets:
                        alias = s.strip().split(" ")
                        #print(alias)
                        if(len(alias) > 1 and (alias[-1].lower() != "asc" and alias[-1].lower() != "desc" and "." not in alias[-1])):
                            if len(alias) == 2:
                                content = content.replace(" " + alias[-1] + ",", " " + aliases[curr_alias] + ",")
                                content = content.replace(" " + alias[-1] + "\n", " " + aliases[curr_alias] + "\n")
                                content = content.replace(alias[-1] + ".", aliases[curr_alias] + ".")
                            else:
                                as_flag = False
                                for i in alias:
                                    if as_flag:
                                        # this is an alias
                                        content = content.replace(" " + i + ",", " " + aliases[curr_alias] + ",")
                                        content = content.replace(" " + i + "\n", " " + aliases[curr_alias] + "\n")
                                        content = content.replace(i + ".", aliases[curr_alias] + ".")
                                        as_flag = False
                                    if i == "as":
                                        as_flag = True
                            curr_alias += 1
        f.write(str(query[0][0]) + ", " + str(query[0][1]) + "," + str(query[0][2]) + "," + str(content))
        new_row = {'queryNum':str(query[0][0]),'queryID': str(query[0][1]), 'variantID':str(query[0][2]), 'queryText':str(content)}
                #append row to the dataframe
        df1 = df1.append(new_row, ignore_index=True)
        f.write("\n")
        
        parsed_queries.append([query[0][0], query[0][1], query[0][2], content])
                    
        #else:
        #    print("more than one")
        #    for p in parsed:
        #        print(p, "boop")
        print("=============")
    df1.to_csv('parsed_queries_from_df.csv',index=False)
    return parsed_queries

In [29]:
def take(n, iterable):
    "Return first n items of the iterable as a list"
    return list(islice(iterable, n))

In [30]:
n = 10
subset = take(n, queries.items())
print(subset)

[((1, 313665, 4388082), "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and\n        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and\n        (e.empName like '_a%' or e.empName like '_i%')\norder by e.empName asc, d.deptName desc"), ((2, 34820, 4388082), "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e join Department d on e.deptID = d.deptID \nWHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))\nORDER BY e.empName,  d.deptName DESC\n\n"), ((3, 325288, 4388082), "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;"), ((4, 36577, 4388082), "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d, Employee e\nWHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)"), ((5, 342776, 4388082), "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')\nORDER BY E.empName, D.deptName DESC"), ((6, 31817, 4388082), "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;"), ((7, 331548, 4388082), "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e join Department d\non e.deptID = d.deptID\nwhere d.deptLocation = 'Dubai' \nor d.deptName = 'Sales' \nand ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)\nand (e.empName like '_A%' or e.empName like '_I%')\norder by e.empName asc, d.deptName desc"), ((8, 131080, 4388082), 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (\ne.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (\ne.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC\n'), ((9, 128458, 4388082), 'SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY d.deptName DESC'), ((10, 127187, 4388082), 'SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle\nFROM Department Dept NATURAL JOIN Employee Emp\nWHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND \n        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND \n        (Emp.empName LIKE \'_A%\' OR Emp.empName LIKE \'_I%\')\nORDER BY Emp.empName, Dept.deptName DESC')]

In [31]:
parse(subset)

=============
=============
=============
=============
=============
=============
=============
=============
=============
=============

[[1,
  313665,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and\n        (a.annualSalary >= 7000 and a.annualSalary <= 100000) and\n        (a.empName like '_a%' or a.empName like '_i%')\norder by a.empName asc, b.deptName desc"],
 [2,
  34820,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a join Department b on a.deptID = b.deptID \nWHERE ((b.deptLocation = 'Dubai') OR (b.deptName = 'Sales')) AND (a.annualSalary >= 84000 AND a.annualSalary <= 120000) AND ((a.empName LIKE '_A%' )OR (a.empName LIKE '_I%'))\nORDER BY a.empName,  b.deptName DESC\n\n"],
 [3,
  325288,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND a.annualSalary >= 84000 AND a.annualSalary <= 120000 AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;"],
 [4,
  36577,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a, Employee b\nWHERE b.deptID = a.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)"],
 [5,
  342776,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (a.deptID = b.deptID) AND (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_i%' OR a.empName LIKE '_a%')\nORDER BY a.empName, b.deptName DESC"],
 [6,
  31817,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;"],
 [7,
  331548,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department d\non a.deptID = b.deptID\nwhere b.deptLocation = 'Dubai' \nor b.deptName = 'Sales' \nand ((a.annualSalary / 12) >= 7000 and (a.annualSalary / 12) <= 10000)\nand (a.empName like '_A%' or a.empName like '_I%')\norder by a.empName asc, b.deptName desc"],
 [8,
  131080,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (\nb.annualSalary <= 100000 AND b.annualSalary >= 70000) AND (\nb.empName LIKE "_a%" OR b.empName LIKE "_i%")\nORDER BY b.empName ASC, a.deptName DESC\n'],
 [9,
  128458,
  4388082,
  'SELECT a.empName as Name, a.annualSalary as Salary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON b.deptID = a.deptID\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 <= 10000 AND a.annualSalary/12 >= 7000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY b.deptName DESC'],
 [10,
  127187,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a NATURAL JOIN Employee Emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND \n        (b.annualSalary >= 12 * 7000 AND b.annualSalary <= 12 * 10000) AND \n        (b.empName LIKE \'_A%\' OR b.empName LIKE \'_I%\')\nORDER BY b.empName, a.deptName DESC']]

In [12]:
queries

{(1,
  313665,
  4388082): "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and\n        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and\n        (e.empName like '_a%' or e.empName like '_i%')\norder by e.empName asc, d.deptName desc",
 (2,
  34820,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e join Department d on e.deptID = d.deptID \nWHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))\nORDER BY e.empName,  d.deptName DESC\n\n",
 (3,
  325288,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;",
 (4,
  36577,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d, Employee e\nWHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)",
 (5,
  342776,
  4388082): "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')\nORDER BY E.empName, D.deptName DESC",
 (6,
  31817,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;",
 (7,
  331548,
  4388082): "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e join Department d\non e.deptID = d.deptID\nwhere d.deptLocation = 'Dubai' \nor d.deptName = 'Sales' \nand ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)\nand (e.empName like '_A%' or e.empName like '_I%')\norder by e.empName asc, d.deptName desc",
 (8,
  131080,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (\ne.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (\ne.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC\n',
 (9,
  128458,
  4388082): 'SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY d.deptName DESC',
 (10,
  127187,
  4388082): 'SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle\nFROM Department Dept NATURAL JOIN Employee Emp\nWHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND \n        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND \n        (Emp.empName LIKE \'_A%\' OR Emp.empName LIKE \'_I%\')\nORDER BY Emp.empName, Dept.deptName DESC',
 (11,
  124539,
  4388082): "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales')\nAND (Employee.annualSalary/12 >= 7000 AND Employee.annualSalary/12 <= 10000)\nAND (SUBSTR(Employee.empName, 2, 1) = 'A'  OR SUBSTR(Employee.empName, 2, 1) = 'I')",
 (12,
  126177,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d INNER JOIN Employee e on e.deptID = d.deptID\nWHERE (d.deptLocation = \'Dubai\' OR d.deptName = \'Sales\') AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")',
 (13,
  83742,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e\nJOIN Department d ON e.deptID = d.deptID\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary >= 7000 OR e.annualSalary <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName ASC, d.deptName DESC\n;",
 (14,
  336531,
  4388082): 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle \nFROM Department D join Employee E\non D.deptID = E.deptID\nwhere (D.deptLocation = "Dubai" or D.deptName= "sales")\nand ((E.annualSalary/12) >= 7000 and (E.annualSalary/12) <= 10000) \n-- and (E.empName like \'_a%\' or \'_i%\')\norder by E.empName, D.deptName DESC',
 (15,
  331920,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <=10000) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName, d.deptName DESC',
 (16,
  35368,
  4388082): 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE deptName = "Sales" AND annualSalary/12 >= 7000 AND annualSalary/12 <= 10000 AND (empName LIKE "_A%" OR empName LIKE "_I%")\nAND jobTitle LIKE "Sales%"\nORDER BY empName, deptName DESC',
 (17,
  313229,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (annualSalary / 12 >= 7000 AND annualSalary / 12 <= 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;",
 (18,
  33496,
  4388082): 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle FROM Employee AS E\nJOIN Department AS D ON D.deptID = E.deptId\nWHERE\n    (D.deptLocation = "Dubai" OR D.deptName = "Sales") AND\n    (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND\n    (E.empName LIKE "_A%" OR E.empName LIKE "_I%")\nORDER BY E.empName, D.deptName DESC',
 (19,
  5259,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR (deptName = 'Sales' AND annualSalary >= 84000 AND annualSalary <= 120000)) AND (empName LIKE '_I%' OR empName LIKE '_A%') \nORDER BY empName ASC, deptName DESC;",
 (20,
  5271,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM (Employee e) NATURAL JOIN (Department d)\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC',
 (21,
  332195,
  4388082): 'Select emp.empName, emp.annualSalary, dep.deptName, dep.deptLocation, emp.jobTitle\nFrom Department dep Natural Join Employee emp\nWHERE (dep.deptLocation = "Dubai" OR dep.deptName = "Sales") AND (emp.annualSalary / 12 >= 7000 AND emp.annualSalary/12 <= 10000) AND (emp.empName LIKE \'_a%\' OR emp.empName LIKE \'_i%\')',
 (22,
  332008,
  4388082): "select Employee.empName, Employee.annualSalary, Department.deptName,Department.deptLocation, Employee.jobTitle\nfrom Employee natural join Department\nwhere (Department.deptLocation = 'Dubai' or deptName = 'Sales') and Employee.annualSalary/12>=7000 and Employee.annualSalary/12<= 10000 and (Employee.empName like '_A%' or Employee.empName like '_I%')\norder by Employee.empName, Department.deptName desc",
 (23,
  11185,
  4388082): "select E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nfrom Employee E join Department D on E.deptID = D.deptID\nwhere (D.deptLocation = 'Dubai' or D.deptName = 'Sales') and ((E.annualSalary/12)>= 7000 and (E.annualSalary/12) <= 10000) and (E.empName LIKE '_A%' or E.empName LIKE '_I%')\norder by E.empName, D.deptName desc",
 (24,
  32963,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e JOIN Department d ON e.deptID = d.deptID \nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary / 12 >= 7000 AND e.annualSalary / 12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC",
 (25,
  12133,
  4388082): "SELECT E1.empName, E1.annualSalary, D1.deptName, D1.deptLocation, E1.jobTitle\nFROM (Employee E1 INNER JOIN Department D1 ON D1.deptID = E1.DeptID)\nWHERE (D1.deptLocation = 'Dubai' OR D1.deptName = 'Sales') AND (E1.annualSalary/12 >= 7000 AND E1.annualSalary/12 <= 10000) AND (E1.empName LIKE '_A%' OR E1.empName LIKE '_I%')\nORDER BY E1.empName, D1.deptName DESC",
 (26,
  34727,
  4388082): 'Select Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFrom Department, Employee\nWhere Employee.deptID = Department.deptID AND Employee.annualSalary>= 94000 AND Employee.annualSalary<= 120000 AND ((Employee.empname LIKE \'_a%\') OR (Employee.empname LIKE \'_i%\')) AND ((Department.deptlocation = "Dubai") OR (Department.deptName = "Sales"))\nOrder by Employee.empname, Department.deptName DESC',
 (27,
  5308,
  4388082): "SELECt Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee, Department\nWHERE (Employee.deptID = Department.deptID) AND (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.annualSalary/12 <= 10000.0 && Employee.annualSalary/12 >= 7000.0) AND (Employee.empName LIKE '_a%' OR Employee.empName LIKE '_i%')",
 (28,
  35941,
  4388082): 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE (deptName = "Sales") AND (annualSalary/12 BETWEEN 7000 AND 10000) AND (empName LIKE \'_A%\' OR empName LIKE \'_I%\') AND jobTitle LIKE "Sales%"\nORDER BY empName ASC, deptName DESC',
 (29,
  4370,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e INNER JOIN Department d ON e.deptID = d.deptId\nWHERE ((d.deptLocation LIKE "Dubai" OR d.deptName LIKE "Sales") AND (e.annualSalary/12 BETWEEN 7000 AND 10000)) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC',
 (30,
  34723,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE \n    (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND \n    ((e.annualSalary / 12 >= 7000) AND (e.annualSalary / 12 <= 10000)) AND \n    (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;",
 (31,
  5126,
  4388082): 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE E.deptId = D.deptId AND (D.deptLocation = "Dubai" OR D.deptName = "Sales")\n    AND (E.annualSalary/12 >= 7000 AND E.annualSalary/12 <=10000) \n    AND (E.empName LIKE \'_A%\' OR E.empName LIKE \'_I%\')',
 (32,
  126556,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e, Department d\nWHERE (d.deptID = e.deptID) AND (d.deptLocation = \'DUBAI\' OR d.deptName = \'SALES\') AND (e.annualSalary/12 BETWEEN 7000 AND 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")',
 (33,
  127606,
  4388082): "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation='Dubai' or d.deptName='Sales')\nand (e.annualSalary/12 >= 7000 or e.annualSalary <= 10000)\nand (e.empName like '%a%' or e.empName like '%i%')",
 (34,
  37267,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND annualSalary >= 7000 AND annualSalary <= 100000 AND empName LIKE '_i%'\nORDER BY empName ASC, deptName DESC",
 (35,
  30481,
  4388082): 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e\nNATURAL JOIN Department d\nWHERE (deptLocation LIKE "Dubai" OR deptName LIKE "Sales") AND\n    (annualSalary >= 7000*12 AND annualSalary <= 10000*12) AND\n    (empName LIKE "_A%" OR empName LIKE "_I%" OR empName LIKE "_a%" OR empName LIKE "_i%")\nORDER BY empName, deptName DESC',
 (36,
  36594,
  4388082): "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E\n    JOIN Department D ON D.deptID = E.deptID\nWHERE (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND\n      ((E.annualSalary / 12) >= 7000 AND (E.annualSalary / 12) <= 10000) AND\n      (empName LIKE '_A%' OR empName LIKE '_I%' OR empName LIKE '_a%' OR empName LIKE '_i%')",
 (37,
  5753,
  4388082): 'select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e inner join Department d on e.deptId = d.deptId\nwhere (d.deptLocation = "Dubai" or d.deptName = "Sales") and \n((e.annualSalary / 12) <= 10000 or (e.annualSalary / 12) >= 7000) and\n(e.empName like "_A%" or e.empName like "_I%")',
 (38,
  37112,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = \'Dubai\' OR d.deptName = \'Sales\') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC',
 (39,
  5791,
  4388082): 'select empName, annualSalary, deptName, deptLocation, jobTitle\nfrom Employee natural join Department\nwhere (deptLocation = "Dubai" or deptName = "Sales")\n    and (annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)\n    and (empName like "_A%" or empName like "_I%")\norder by empName, deptName desc',
 (40,
  36387,
  4388082): "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle \nFROM Employee\nINNER JOIN Department on Employee.deptId = Department.deptId\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.empName LIKE '_I%' OR Employee.empName LIKE '_A%')\nGROUP BY Employee.empId\nORDER BY Employee.empName ASC, Department.deptName DESC;",
 (41,
  336388,
  4388082): "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nJOIN Department as d\nON e.deptID = d.deptID\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName ASC, d.deptName DESC",
 (42,
  331540,
  4388082): "Select E.empName,E.annualSalary,D.deptName,D.deptLocation,E.jobTitle\nfrom Employee E,Department D,Salary_Grade S\nwhere E.deptID=D.deptID and E.annualSalary >= S.minAnnualSalary and E.annualSalary <= S.maxAnnualSalary and\n(D.deptLocation LIKE 'Dubai' OR D.deptName LIKE 'Sales') and \n(E.annualSalary/12 >= 7000 and E.annualSalary/12 <= 10000) and\n(E.empName LIKE '_A%' OR E.empName LIKE '_I%')\norder by E.empName,D.deptName DESC",
 (43,
  36209,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle \nFROM Employee e, Department d\nWHERE e.deptId = d.deptId \n    AND (d.deptLocation = "Dubai" OR d.deptName = "Sales")\n    AND ((e.empName LIKE "_a%") OR (e.empName LIKE "_i%"));\n    ',
 (44,
  33198,
  4388082): 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e, Department d\nWHERE ((d.deptName = "Sales" AND e.jobTitle LIKE \'%Sales%\')) AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE \'_A%\' OR e.empName LIKE \'_I%\') AND e.annualSalary IN (SELECT e2.annualSalary FROM Employee e2, Salary_Grade s WHERE e2.annualSalary >= s.minAnnualSalary AND e2.annualSalary <= s.maxAnnualSalary)\nORDER BY e.empName, d.deptName DESC',
 (45,
  5435,
  4388082): "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee emp\nJOIN Department dept\nON dept.deptID = emp.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') \nAND (annualSalary >= 84000 AND annualSalary\t<= 120000) \nAND (empName LIKE '_A%' OR empName LIKE '_I%')",
 (46,
  260731,
  4388083): 'SELECT e.empName, e.annualSalary/12 as monthlySalary, d.deptName, e.hireDate\nFROM Employee e JOIN Department d ON e.deptID = d.deptID\nWHERE e.hireDate IN (SELECT MAX(hireDate) FROM Employee where deptID=e.deptID) AND\ne.annualSalary >=(SELECT minAnnualSalary FROM Salary_Grade WHERE grade =12) AND e.annualSalary <=(SELECT maxAnnualSalary FROM Salary_Grade WHERE grade =12)\nORDER BY e.empName, monthlySalary DESC',
 (47,
  37657,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.deptID) as empCnt\nFROM Department d LEFT OUTER JOIN Employee e on d.deptID = e.deptID \nGROUP BY d.deptID\nORDER BY empCnt ASC, d.deptName DESC',
 (48,
  36038,
  4017605): 'Select d.deptName, d.deptLocation, Count(e.empID) as empCNT\nfrom Department d Left outer join Employee e On (d.deptID = e.deptID)\ngroup by  d.deptID\norder by empCNT, d.deptName DESC',
 (49,
  325288,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.empID) as empCnt\nFROM Department d LEFT JOIN Employee e ON (d.deptID = e.deptID)\nGROUP BY d.deptID\nORDER BY empCnt, d.deptName DESC;',
 (50,
  34406,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(DISTINCT(e.empID))\nFROM Employee e RIGHT OUTER JOIN Department d ON e.deptID = d.deptID\nGROUP BY d.deptID\nORDER BY COUNT(DISTINCT(e.empID)), d.deptName DESC',
 (51,
  129745,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.empID) as empCNT\nFROM Department d \nLEFT OUTER JOIN Employee e ON d.deptID = e.deptID\nGROUP BY d.deptId\nORDER BY empCNT, d.deptName DESC;',
 (52,
  34602,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.empID)\nFROM Department d\nLEFT OUTER JOIN Employee e\nON d.deptID = e.deptID\nGROUP BY d.deptName, d.deptLocation\nORDER BY COUNT(e.empID), d.deptName DESC',
 (53,
  186896,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.deptID)\nFROM Department d LEFT OUTER JOIN Employee e ON d.deptID = e.deptID\nGROUP BY d.deptName, d.deptLocation, d.deptID\nORDER BY COUNT(e.deptID), d.deptName DESC',
 (54,
  5259,
  4017605): 'SELECT deptName, deptLocation, count(empID) as total_employee\nFROM Department LEFT JOIN Employee ON Department.deptID = Employee.deptID\nGROUP BY Department.deptID\nORDER BY total_employee ASC, deptName DESC;',
 (55,
  5265,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(e.empID) AS numEmployees\nFROM Department d\nLEFT OUTER JOIN Employee e\nON d.deptID = e.deptID\nGROUP BY d.deptID\nORDER BY numEmployees ASC, d.deptName DESC',
 (56,
  5256,
  4017605): 'SELECT d.deptName, d.deptLocation, COUNT(empID) as empCnt\nFROM Department d LEFT OUTER JOIN Employee e ON (d.deptID = e.deptID)\nGROUP BY deptName, deptLocation\nORDER BY empCnt, deptName DESC',
 (57,
  36050,
  4017605): 'SELECT d.deptName, d.deptLocation, count(e.empID)\nFROM Employee e RIGHT JOIN Department d\n        on e.deptID = d.deptID \nGROUP BY d.deptID\nORDER BY count(e.empID) ASC, d.deptName DESC',
 (58,
  5283,
  4017605): 'SELECT d.deptName, d. deptLocation, COUNT(e.empID) as empIDCount\nFrom Department d LEFT Outer Join Employee e ON (d.deptID = e.deptID)\nGROUP BY d.deptID\nORDER BY empIDCount, d.deptName DESC',
 (59,
  32807,

In [22]:
par_queries

[[1,
  313665,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and\n        (a.annualSalary >= 7000 and a.annualSalary <= 100000) and\n        (a.empName like '_a%' or a.empName like '_i%')\norder by a.empName asc, b.deptName desc"],
 [2,
  34820,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a join Department b on a.deptID = b.deptID \nWHERE ((b.deptLocation = 'Dubai') OR (b.deptName = 'Sales')) AND (a.annualSalary >= 84000 AND a.annualSalary <= 120000) AND ((a.empName LIKE '_A%' )OR (a.empName LIKE '_I%'))\nORDER BY a.empName,  b.deptName DESC\n\n"],
 [3,
  325288,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND a.annualSalary >= 84000 AND a.annualSalary <= 120000 AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;"],
 [4,
  36577,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a, Employee b\nWHERE b.deptID = a.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)"],
 [5,
  342776,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (a.deptID = b.deptID) AND (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_i%' OR a.empName LIKE '_a%')\nORDER BY a.empName, b.deptName DESC"],
 [6,
  31817,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;"],
 [7,
  331548,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department d\non a.deptID = b.deptID\nwhere b.deptLocation = 'Dubai' \nor b.deptName = 'Sales' \nand ((a.annualSalary / 12) >= 7000 and (a.annualSalary / 12) <= 10000)\nand (a.empName like '_A%' or a.empName like '_I%')\norder by a.empName asc, b.deptName desc"],
 [8,
  131080,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a JOIN Employee b ON a.deptID = b.deptID\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (\nb.annualSalary <= 100000 AND b.annualSalary >= 70000) AND (\nb.empName LIKE "_a%" OR b.empName LIKE "_i%")\nORDER BY b.empName ASC, a.deptName DESC\n'],
 [9,
  128458,
  4388082,
  'SELECT a.empName as Name, a.annualSalary as Salary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON b.deptID = a.deptID\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 <= 10000 AND a.annualSalary/12 >= 7000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY b.deptName DESC'],
 [10,
  127187,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a NATURAL JOIN Employee Emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND \n        (b.annualSalary >= 12 * 7000 AND b.annualSalary <= 12 * 10000) AND \n        (b.empName LIKE \'_A%\' OR b.empName LIKE \'_I%\')\nORDER BY b.empName, a.deptName DESC'],
 [11,
  124539,
  4388082,
  "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales')\nAND (Employee.annualSalary/12 >= 7000 AND Employee.annualSalary/12 <= 10000)\nAND (SUBSTR(Employee.empName, 2, 1) = 'A'  OR SUBSTR(Employee.empName, 2, 1) = 'I')"],
 [12,
  126177,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFROM Department a INNER JOIN Employee b on b.deptID = a.deptID\nWHERE (a.deptLocation = \'Dubai\' OR a.deptName = \'Sales\') AND (b.annualSalary >= 84000 AND b.annualSalary <= 120000) AND (b.empName LIKE "_A%" OR b.empName LIKE "_I%")'],
 [13,
  83742,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee e\nJOIN Department b ON a.deptID = b.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary >= 7000 OR a.annualSalary <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName ASC, b.deptName DESC\n;"],
 [14,
  336531,
  4388082,
  'SELECT b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle \nFROM Department a join Employee E\non a.deptID = b.deptID\nwhere (a.deptLocation = "Dubai" or a.deptName= "sales")\nand ((b.annualSalary/12) >= 7000 and (b.annualSalary/12) <= 10000) \n-- and (b.empName like \'_a%\' or \'_i%\')\norder by b.empName, a.deptName DESC'],
 [15,
  331920,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <=10000) AND (a.empName LIKE "_a%" OR a.empName LIKE "_i%")\nORDER BY a.empName, b.deptName DESC'],
 [16,
  35368,
  4388082,
  'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE deptName = "Sales" AND annualSalary/12 >= 7000 AND annualSalary/12 <= 10000 AND (empName LIKE "_A%" OR empName LIKE "_I%")\nAND jobTitle LIKE "Sales%"\nORDER BY empName, deptName DESC'],
 [17,
  313229,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (annualSalary / 12 >= 7000 AND annualSalary / 12 <= 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;"],
 [18,
  33496,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle FROM Employee AS E\nJOIN Department AS b ON b.deptID = a.deptId\nWHERE\n    (b.deptLocation = "Dubai" OR b.deptName = "Sales") AND\n    (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND\n    (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY a.empName, b.deptName DESC'],
 [19,
  5259,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR (deptName = 'Sales' AND annualSalary >= 84000 AND annualSalary <= 120000)) AND (empName LIKE '_I%' OR empName LIKE '_A%') \nORDER BY empName ASC, deptName DESC;"],
 [20,
  5271,
  4388082,
  'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM (Employee e) NATURAL JOIN (Department d)\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC'],
 [21,
  332195,
  4388082,
  'Select b.empName, b.annualSalary, a.deptName, a.deptLocation, b.jobTitle\nFrom Department a Natural Join Employee emp\nWHERE (a.deptLocation = "Dubai" OR a.deptName = "Sales") AND (b.annualSalary / 12 >= 7000 AND b.annualSalary/12 <= 10000) AND (b.empName LIKE \'_a%\' OR b.empName LIKE \'_i%\')'],
 [22,
  332008,
  4388082,
  "select Employee.empName, Employee.annualSalary, Department.deptName,Department.deptLocation, Employee.jobTitle\nfrom Employee natural join Department\nwhere (Department.deptLocation = 'Dubai' or deptName = 'Sales') and Employee.annualSalary/12>=7000 and Employee.annualSalary/12<= 10000 and (Employee.empName like '_A%' or Employee.empName like '_I%')\norder by Employee.empName, Department.deptName desc"],
 [23,
  11185,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a join Department b on a.deptID = b.deptID\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and ((a.annualSalary/12)>= 7000 and (a.annualSalary/12) <= 10000) and (a.empName LIKE '_A%' or a.empName LIKE '_I%')\norder by a.empName, b.deptName desc"],
 [24,
  32963,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a JOIN Department b ON a.deptID = b.deptID \nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary / 12 >= 7000 AND a.annualSalary / 12 <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC"],
 [25,
  12133,
  4388082,
  "SELECT E1.empName, E1.annualSalary, D1.deptName, D1.deptLocation, E1.jobTitle\nFROM (Employee E1 INNER JOIN Department D1 ON D1.deptID = E1.DeptID)\nWHERE (D1.deptLocation = 'Dubai' OR D1.deptName = 'Sales') AND (E1.annualSalary/12 >= 7000 AND E1.annualSalary/12 <= 10000) AND (E1.empName LIKE '_A%' OR E1.empName LIKE '_I%')\nORDER BY E1.empName, D1.deptName DESC"],
 [26,
  34727,
  4388082,
  'Select Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFrom Department, Employee\nWhere Employee.deptID = Department.deptID AND Employee.annualSalary>= 94000 AND Employee.annualSalary<= 120000 AND ((Employee.empname LIKE \'_a%\') OR (Employee.empname LIKE \'_i%\')) AND ((Department.deptlocation = "Dubai") OR (Department.deptName = "Sales"))\nOrder by Employee.empname, Department.deptName DESC'],
 [27,
  5308,
  4388082,
  "SELECt Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee, Department\nWHERE (Employee.deptID = Department.deptID) AND (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.annualSalary/12 <= 10000.0 && Employee.annualSalary/12 >= 7000.0) AND (Employee.empName LIKE '_a%' OR Employee.empName LIKE '_i%')"],
 [28,
  35941,
  4388082,
  'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE (deptName = "Sales") AND (annualSalary/12 BETWEEN 7000 AND 10000) AND (empName LIKE \'_A%\' OR empName LIKE \'_I%\') AND jobTitle LIKE "Sales%"\nORDER BY empName ASC, deptName DESC'],
 [29,
  4370,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a INNER JOIN Department b ON a.deptID = b.deptId\nWHERE ((b.deptLocation LIKE "Dubai" OR b.deptName LIKE "Sales") AND (a.annualSalary/12 BETWEEN 7000 AND 10000)) AND (a.empName LIKE "_a%" OR a.empName LIKE "_i%")\nORDER BY a.empName ASC, b.deptName DESC'],
 [30,
  34723,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE \n    (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND \n    ((a.annualSalary / 12 >= 7000) AND (a.annualSalary / 12 <= 10000)) AND \n    (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName, b.deptName DESC;"],
 [31,
  5126,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE a.deptId = b.deptId AND (b.deptLocation = "Dubai" OR b.deptName = "Sales")\n    AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <=10000) \n    AND (a.empName LIKE \'_A%\' OR a.empName LIKE \'_I%\')'],
 [32,
  126556,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE (b.deptID = a.deptID) AND (b.deptLocation = \'DUBAI\' OR b.deptName = \'SALES\') AND (a.annualSalary/12 BETWEEN 7000 AND 10000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")'],
 [33,
  127606,
  4388082,
  "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation='Dubai' or b.deptName='Sales')\nand (a.annualSalary/12 >= 7000 or a.annualSalary <= 10000)\nand (a.empName like '%a%' or a.empName like '%i%')"],
 [34,
  37267,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND annualSalary >= 7000 AND annualSalary <= 100000 AND empName LIKE '_i%'\nORDER BY empName ASC, deptName DESC"],
 [35,
  30481,
  4388082,
  'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e\nNATURAL JOIN Department d\nWHERE (deptLocation LIKE "Dubai" OR deptName LIKE "Sales") AND\n    (annualSalary >= 7000*12 AND annualSalary <= 10000*12) AND\n    (empName LIKE "_A%" OR empName LIKE "_I%" OR empName LIKE "_a%" OR empName LIKE "_i%")\nORDER BY empName, deptName DESC'],
 [36,
  36594,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee E\n    JOIN Department b ON b.deptID = a.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND\n      ((a.annualSalary / 12) >= 7000 AND (a.annualSalary / 12) <= 10000) AND\n      (empName LIKE '_A%' OR empName LIKE '_I%' OR empName LIKE '_a%' OR empName LIKE '_i%')"],
 [37,
  5753,
  4388082,
  'select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a inner join Department b on a.deptId = b.deptId\nwhere (b.deptLocation = "Dubai" or b.deptName = "Sales") and \n((a.annualSalary / 12) <= 10000 or (a.annualSalary / 12) >= 7000) and\n(a.empName like "_A%" or a.empName like "_I%")'],
 [38,
  37112,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a NATURAL JOIN Department d\nWHERE (b.deptLocation = \'Dubai\' OR b.deptName = \'Sales\') AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE "_A%" OR a.empName LIKE "_I%")\nORDER BY a.empName, b.deptName DESC'],
 [39,
  5791,
  4388082,
  'select empName, annualSalary, deptName, deptLocation, jobTitle\nfrom Employee natural join Department\nwhere (deptLocation = "Dubai" or deptName = "Sales")\n    and (annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)\n    and (empName like "_A%" or empName like "_I%")\norder by empName, deptName desc'],
 [40,
  36387,
  4388082,
  "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle \nFROM Employee\nINNER JOIN Department on Employee.deptId = Department.deptId\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.empName LIKE '_I%' OR Employee.empName LIKE '_A%')\nGROUP BY Employee.empId\nORDER BY Employee.empName ASC, Department.deptName DESC;"],
 [41,
  336388,
  4388082,
  "SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee as e\nJOIN Department as d\nON a.deptID = b.deptID\nWHERE (b.deptLocation = 'Dubai' OR b.deptName = 'Sales') AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE '_A%' OR a.empName LIKE '_I%')\nORDER BY a.empName ASC, b.deptName DESC"],
 [42,
  331540,
  4388082,
  "Select a.empName,a.annualSalary,b.deptName,b.deptLocation,a.jobTitle\nfrom Employee a,Department b,Salary_Grade c\nwhere a.deptID=b.deptID and a.annualSalary >= c.minAnnualSalary and a.annualSalary <= c.maxAnnualSalary and\n(b.deptLocation LIKE 'Dubai' OR b.deptName LIKE 'Sales') and \n(a.annualSalary/12 >= 7000 and a.annualSalary/12 <= 10000) and\n(a.empName LIKE '_A%' OR a.empName LIKE '_I%')\norder by a.empName,b.deptName DESC"],
 [43,
  36209,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle \nFROM Employee a, Department b\nWHERE a.deptId = b.deptId \n    AND (b.deptLocation = "Dubai" OR b.deptName = "Sales")\n    AND ((a.empName LIKE "_a%") OR (a.empName LIKE "_i%"));\n    '],
 [44,
  33198,
  4388082,
  'SELECT a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nFROM Employee a, Department b\nWHERE ((b.deptName = "Sales" AND a.jobTitle LIKE \'%Sales%\')) AND (a.annualSalary/12 >= 7000 AND a.annualSalary/12 <= 10000) AND (a.empName LIKE \'_A%\' OR a.empName LIKE \'_I%\') AND a.annualSalary IN (SELECT e2.annualSalary FROM Employee e2, Salary_Grade s WHERE e2.annualSalary >= s.minAnnualSalary AND e2.annualSalary <= s.maxAnnualSalary)\nORDER BY a.empName, b.deptName DESC'],
 [45,
  5435,
  4388082,
  "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee emp\nJOIN Department dept\nON b.deptID = a.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') \nAND (annualSalary >= 84000 AND annualSalary\t<= 120000) \nAND (empName LIKE '_A%' OR empName LIKE '_I%')"],
 [46,
  260731,
  4388083,
  'SELECT a.empName, a.annualSalary/12 as monthlySalary, b.deptName, a.hireDate\nFROM Employee a JOIN Department b ON a.deptID = b.deptID\nWHERE a.hireDate IN (SELECT MAX(hireDate) FROM Employee where deptID=a.deptID) AND\na.annualSalary >=(SELECT minAnnualSalary FROM Salary_Grade WHERE grade =12) AND a.annualSalary <=(SELECT maxAnnualSalary FROM Salary_Grade WHERE grade =12)\nORDER BY a.empName, monthlySalary DESC'],
 [47,
  37657,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.deptID) as empCnt\nFROM Department a LEFT OUTER JOIN Employee b on a.deptID = b.deptID \nGROUP BY a.deptID\nORDER BY empCnt ASC, a.deptName DESC'],
 [48,
  36038,
  4017605,
  'Select a.deptName, a.deptLocation, Count(b.empID) as empCNT\nfrom Department a Left outer join Employee b On (a.deptID = b.deptID)\ngroup by  a.deptID\norder by empCNT, a.deptName DESC'],
 [49,
  325288,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.empID) as empCnt\nFROM Department a LEFT JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY a.deptID\nORDER BY empCnt, a.deptName DESC;'],
 [50,
  34406,
  4017605,
  'SELECT b.deptName, b.deptLocation, COUNT(DISTINCT(a.empID))\nFROM Employee a RIGHT OUTER JOIN Department b ON a.deptID = b.deptID\nGROUP BY b.deptID\nORDER BY COUNT(DISTINCT(a.empID)), b.deptName DESC'],
 [51,
  129745,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.empID) as empCNT\nFROM Department a \nLEFT OUTER JOIN Employee b ON a.deptID = b.deptID\nGROUP BY a.deptId\nORDER BY empCNT, a.deptName DESC;'],
 [52,
  34602,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.empID)\nFROM Department d\nLEFT OUTER JOIN Employee e\nON a.deptID = b.deptID\nGROUP BY a.deptName, a.deptLocation\nORDER BY COUNT(b.empID), a.deptName DESC'],
 [53,
  186896,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.deptID)\nFROM Department a LEFT OUTER JOIN Employee b ON a.deptID = b.deptID\nGROUP BY a.deptName, a.deptLocation, a.deptID\nORDER BY COUNT(b.deptID), a.deptName DESC'],
 [54,
  5259,
  4017605,
  'SELECT deptName, deptLocation, count(empID) as total_employee\nFROM Department LEFT JOIN Employee ON Department.deptID = Employee.deptID\nGROUP BY Department.deptID\nORDER BY total_employee ASC, deptName DESC;'],
 [55,
  5265,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(b.empID) AS numEmployees\nFROM Department d\nLEFT OUTER JOIN Employee e\nON a.deptID = b.deptID\nGROUP BY a.deptID\nORDER BY numEmployees ASC, a.deptName DESC'],
 [56,
  5256,
  4017605,
  'SELECT a.deptName, a.deptLocation, COUNT(empID) as empCnt\nFROM Department a LEFT OUTER JOIN Employee b ON (a.deptID = b.deptID)\nGROUP BY deptName, deptLocation\nORDER BY empCnt, deptName DESC'],
 [57,
  36050,
  4017605,
  'SELECT b.deptName, b.deptLocation, count(a.empID)\nFROM Employee a RIGHT JOIN Department d\n        on a.deptID = b.deptID \nGROUP BY b.deptID\nORDER BY count(a.empID) ASC, b.deptName DESC'],
 [58,
  5283,
  4017605,
  'SELECT a.deptName, a. deptLocation, COUNT(b.empID) as empIDCount\nFrom Department a LEFT Outer Join Employee b ON (a.deptID = b.deptID)\nGROUP BY a.deptID\nORDER BY empIDCount, a.deptName DESC'],
 [59,
  32807,
  4017605,

In [32]:
par_queries = parse(queries.items())

=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============

=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============

=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============
=============

In [192]:
parse([list(queries.items())[-2]])

more than one
SELECT p1.ProductName, COUNT(p2.YearReleased) - 1
FROM Products as p1, Products as p2
WHERE (p1.BrandName = p2.BrandName AND p2.YearReleased < p1.YearReleased) OR
      (p1.ProductName = p2.ProductName)
GROUP BY p1.ProductName; boop

 boop
=============

[]

In [179]:
par_queries[0]

(1,
 "select a.empName, a.annualSalary, b.deptName, b.deptLocation, a.jobTitle\nfrom Employee a natural join Department d\nwhere (b.deptLocation = 'Dubai' or b.deptName = 'Sales') and\n        (a.annualSalary >= 7000 and a.annualSalary <= 100000) and\n        (a.empName like '_a%' or a.empName like '_i%')\norder by a.empName asc, b.deptName desc")

In [198]:
par_queries[-2]

(1417,
 'SELECT a.ProductName, COUNT(b.YearReleased) - 1\nFROM Products as a, Products as b\nWHERE (a.BrandName = b.BrandName AND b.YearReleased < a.YearReleased) OR\n      (a.ProductName = b.ProductName)\nGROUP BY a.ProductName;\n')

In [196]:
len(par_queries)

1418